Обработки/Reports/_ИзмененияНаУровне3.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ИзмененияНаУровне3</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ИзмененияНаУровне3/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Сверка изменений по уровню 3 иерархии справедливой стоимости",
		"0.19",
		"",
		Истина);
		
	// команды отсутствуют - только интерактивный запуск
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция ПолучитьПараметрыШапки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|ПОМЕСТИТЬ _КлиентДоверительногоУправления
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицОрганизации.КраткоеНаименованиеПоУставу КАК ДоверительныйУправляющий,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаДоговора,
		|	&Период КАК ДатаОтчета,
		|	&ПоследнийРабочийДень КАК ПоследнийРабочийДень,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицКлиента.КраткоеНаименованиеПоУставу, РеквизитыФизическихЛицКлиента.Фамилия + "" "" + ПОДСТРОКА(РеквизитыФизическихЛицКлиента.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыФизическихЛицКлиента.Отчество, 1, 1) + ""."") КАК УчредительУправления
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			ЮрФизЛицо = &ЮрФизЛицо
		|				И Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицОрганизации,
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления,
		|	_КлиентДоверительногоУправления КАК _КлиентДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицКлиента
		|		ПО _КлиентДоверительногоУправления.Клиент = РеквизитыФизическихЛицКлиента.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицКлиента
		|		ПО _КлиентДоверительногоУправления.Клиент = РеквизитыЮридическихЛицКлиента.ЮрФизЛицо
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления";
		
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ПоследнийРабочийДень", НачалоДня(Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, ЭтотОбъект.Период.ДатаОкончания)));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ЮрФизЛицо", ЭтотОбъект.Организация.ЮрФизЛицо);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
		
КонецФункции

Функция ВернутьИтогПоРазделу(Данные, ИтоговыеПоля)
	
	Итог = 0;
	Для Каждого ИтоговоеПоле из ИтоговыеПоля Цикл 
		Итог = Итог + Данные.Итог(ИтоговоеПоле); 
	КонецЦикла;	
	
	Возврат Итог;
	
КонецФункции	

Процедура ВывестиРаздел(ДокРезультат, ОбластьРаздел, НомерСтроки, Наименование, СуммаИтог)
	
	ОбластьРаздел.Параметры.НомерСтроки = НомерСтроки;
	ОбластьРаздел.Параметры.Наименование = Наименование;
	ОбластьРаздел.Параметры.Сумма = СуммаИтог;
	ДокРезультат.Вывести(ОбластьРаздел);
	
КонецПроцедуры 	

Процедура ВывестиРасшифровку(ДокРезультат, Данные, ОбластьШапка, ОбластьДанные, ОбластьИтог, ИтоговыеПоля)
	
	ДокРезультат.НачатьГруппуСтрок();
	ДокРезультат.Вывести(ОбластьШапка);
	
	Для Каждого СтрокаДанные из Данные Цикл 
		ЗаполнитьЗначенияСвойств(ОбластьДанные.Параметры, СтрокаДанные); 
		ДокРезультат.Вывести(ОбластьДанные);
	КонецЦикла;	
	
	Для Каждого ИтоговоеПоле из ИтоговыеПоля Цикл 
		ОбластьИтог.Параметры[ИтоговоеПоле] = Данные.Итог(ИтоговоеПоле); 
	КонецЦикла;	
		
	ДокРезультат.Вывести(ОбластьИтог);	
	ДокРезультат.ЗакончитьГруппуСтрок();
		
КонецПроцедуры	

Процедура СформироватьОтчет(ДокРезультат)	Экспорт
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".СформироватьОтчет()";
    Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);

	ДокРезультат.Очистить();
	
	Параметры = Новый Структура;
	Параметры.Вставить("НачалоПериода", ЭтотОбъект.Период.ДатаНачала);
	Параметры.Вставить("КонецПериода", ЭтотОбъект.Период.ДатаОкончания);
	Параметры.Вставить("Организация", ЭтотОбъект.Организация);
	Параметры.Вставить("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	РезультатЗапроса = РаботаСОтчетами.ПолучитьДанныеОСверкеИзмененийПоУровнюИерархии3(Параметры, Истина);
	
	Макет =  ПолучитьМакет("Отчет");		
	
	РезультатПроверки = 0;
	
	//шапка
	ПараметрыШапки = ПолучитьПараметрыШапки();	
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");	
	ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
	ОбластьШапка.Параметры.ДатаДоговора	= Формат(ПараметрыШапки.ДатаДоговора, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.НомерДоговора = ПараметрыШапки.НомерДоговора;
	ОбластьШапка.Параметры.ПериодОтчета = ПредставлениеПериода(НачалоМесяца(ЭтотОбъект.Период.ДатаНачала), КонецМесяца(ЭтотОбъект.Период.ДатаОкончания), "ФП=Истина");
	
	ДокРезультат.Вывести(ОбластьШапка);
	
	//тело отчета
	ОбластьРаздел = Макет.ПолучитьОбласть("Раздел");
		
	//строка 01. Начальные остатки
	Данные = РезультатЗапроса._ОстаткиНачало;
	НазваниеРаздела = "Справедливая стоимость на " + Формат(ЭтотОбъект.Период.ДатаНачала,  "ДФ=dd.MM.yyyy");
	ИтоговыеПоля = Новый Массив;
	ИтоговыеПоля.Добавить("Сумма");
	ИтоговыеПоля.Добавить("СуммаКупона");
	СуммаИтог = ВернутьИтогПоРазделу(Данные, ИтоговыеПоля);
	ВывестиРаздел(ДокРезультат, ОбластьРаздел, "01", НазваниеРаздела, СуммаИтог);
	
	РезультатПроверки = РезультатПроверки + СуммаИтог; 
		
	ОбластьОстатки = Макет.ПолучитьОбласть("Остатки");
	ОбластьСтрОстатки = Макет.ПолучитьОбласть("СтрОстатки");
	ОбластьОстаткиИтог = Макет.ПолучитьОбласть("ОстаткиИтог");
	
	ВывестиРасшифровку(ДокРезультат, Данные, ОбластьОстатки, ОбластьСтрОстатки, ОбластьОстаткиИтог, ИтоговыеПоля);
	
	//строка 02 Доходы
	Данные = РезультатЗапроса._ФинрезСтрока2;
	Данные.Сортировать("Период, ЦеннаяБумага");
	
	ИтоговыеПоля = Новый Массив;
	ИтоговыеПоля.Добавить("СуммаПереоценка");
	ИтоговыеПоля.Добавить("ДисконтПремияПриход");
	ИтоговыеПоля.Добавить("КорректировкаПриход");
	ИтоговыеПоля.Добавить("СуммаКупонПереоценкаПриход");
	СуммаИтог = ВернутьИтогПоРазделу(Данные, ИтоговыеПоля);;
	НазваниеРаздела = "Доходы или расходы, отраженные в составе прибыли или убытка за год";
	ВывестиРаздел(ДокРезультат, ОбластьРаздел, "02", НазваниеРаздела, СуммаИтог);
	
	РезультатПроверки = РезультатПроверки + СуммаИтог; 
	
	ОбластьДоходы = Макет.ПолучитьОбласть("Доходы");
	ОбластьСтрДоход = Макет.ПолучитьОбласть("СтрДоход");
	ОбластьДоходИтог = Макет.ПолучитьОбласть("ДоходИтог");
	
	ВывестиРасшифровку(ДокРезультат, Данные, ОбластьДоходы, ОбластьСтрДоход, ОбластьДоходИтог, ИтоговыеПоля);
	
	//строка 04. Приобретение 
	Данные = РезультатЗапроса._ПокупкиУровень;
	Данные.Сортировать("Период, ЦеннаяБумага");
	
	ИтоговыеПоля = Новый Массив;
	ИтоговыеПоля.Добавить("СуммаПриход");
	ИтоговыеПоля.Добавить("СуммаКупонаПриход");
	ИтоговыеПоля.Добавить("РазницаПППриход");
	СуммаИтог = ВернутьИтогПоРазделу(Данные, ИтоговыеПоля);
	НазваниеРаздела = "Приобретение";
	ВывестиРаздел(ДокРезультат, ОбластьРаздел, "04", НазваниеРаздела, СуммаИтог);
	
	РезультатПроверки = РезультатПроверки + СуммаИтог; 
	
	ОбластьПокупка = Макет.ПолучитьОбласть("Покупка");
	ОбластьСтрПокупка = Макет.ПолучитьОбласть("СтрПокупка");
	ОбластьПокупкаИтог = Макет.ПолучитьОбласть("ПокупкаИтог");

	ВывестиРасшифровку(ДокРезультат, Данные, ОбластьПокупка, ОбластьСтрПокупка, ОбластьПокупкаИтог, ИтоговыеПоля);
	
	//строка 06. Реализация
	
	Данные = РезультатЗапроса._ПродажиУровень;
	Данные.Сортировать("Период, ЦеннаяБумага");
	
	ИтоговыеПоля = Новый Массив;
	ИтоговыеПоля.Добавить("СуммаРасход");
	ИтоговыеПоля.Добавить("СуммаКупонаРасход");
	ИтоговыеПоля.Добавить("СуммаПереоценкаРасход");
	ИтоговыеПоля.Добавить("СуммаКупонПереоценкаРасход");
	ИтоговыеПоля.Добавить("ДисконтПремияРасход");
	ИтоговыеПоля.Добавить("КорректировкаРасход");
	ИтоговыеПоля.Добавить("РазницаППРасход");
	СуммаИтог = ВернутьИтогПоРазделу(Данные, ИтоговыеПоля);
	НазваниеРаздела = "Реализация";
	ВывестиРаздел(ДокРезультат, ОбластьРаздел, "06", НазваниеРаздела, СуммаИтог);
	
	РезультатПроверки = РезультатПроверки - СуммаИтог; 
	
	ОбластьПродажа = Макет.ПолучитьОбласть("Продажа");
	ОбластьСтрПродажа = Макет.ПолучитьОбласть("СтрПродажа");
	ОбластьПродажаИтог = Макет.ПолучитьОбласть("ПродажаИтог");

	ВывестиРасшифровку(ДокРезультат, Данные, ОбластьПродажа, ОбластьСтрПродажа, ОбластьПродажаИтог, ИтоговыеПоля);
	
	//строка 07. Расчеты.  По структуре похода на реализацию. Итоги и области одинаковые
	Данные = РезультатЗапроса._Расчеты;
	Данные.Сортировать("Период, ЦеннаяБумага");
	
	СуммаИтог = ВернутьИтогПоРазделу(Данные, ИтоговыеПоля);
	НазваниеРаздела = "Расчеты";
	ВывестиРаздел(ДокРезультат, ОбластьРаздел, "07", НазваниеРаздела, СуммаИтог);
	
	РезультатПроверки = РезультатПроверки - СуммаИтог; 
	
	ВывестиРасшифровку(ДокРезультат, Данные, ОбластьПродажа, ОбластьСтрПродажа, ОбластьПродажаИтог, ИтоговыеПоля);
	
	//Строка 08. Перевод с уровня 3
	Данные = РезультатЗапроса._СУровня;
	Данные.Сортировать("Период, ЦеннаяБумага");
	
	ИтоговыеПоля = Новый Массив;
	ИтоговыеПоля.Добавить("Сумма");
	ИтоговыеПоля.Добавить("СуммаКупона");
	СуммаИтог = ВернутьИтогПоРазделу(Данные, ИтоговыеПоля);
	НазваниеРаздела = "Перевод с 3 уровня";
	ВывестиРаздел(ДокРезультат, ОбластьРаздел, "08", НазваниеРаздела, СуммаИтог);
	
	РезультатПроверки = РезультатПроверки - СуммаИтог; 
	
	ОбластьПереход = Макет.ПолучитьОбласть("Переход");
	ОбластьСтрПереход = Макет.ПолучитьОбласть("СтрПереход");
	ОбластьПереходИтог = Макет.ПолучитьОбласть("ПереходИтог");

	ВывестиРасшифровку(ДокРезультат, Данные, ОбластьПереход, ОбластьСтрПереход, ОбластьПереходИтог, ИтоговыеПоля);	
		
	//Строка 09. Перевод на уровень 3
	Данные = РезультатЗапроса._НаУровень;
	Данные.Сортировать("Период, ЦеннаяБумага");
	СуммаИтог = ВернутьИтогПоРазделу(Данные, ИтоговыеПоля);	
	НазваниеРаздела = "Перевод на 3 уровень";
	ВывестиРаздел(ДокРезультат, ОбластьРаздел, "09", НазваниеРаздела, СуммаИтог);

	РезультатПроверки = РезультатПроверки + СуммаИтог; 
	
	ВывестиРасшифровку(ДокРезультат, Данные, ОбластьПереход, ОбластьСтрПереход, ОбластьПереходИтог, ИтоговыеПоля);	

	//строка 10. Конечные остатки
	Данные = РезультатЗапроса._ОстаткиКонец;
	НазваниеРаздела = "Справедливая стоимость на " + Формат(ЭтотОбъект.Период.ДатаОкончания,  "ДФ=dd.MM.yyyy");
	ИтоговыеПоля = Новый Массив;
	ИтоговыеПоля.Добавить("Сумма");
	ИтоговыеПоля.Добавить("СуммаКупона");
	СуммаИтог = ВернутьИтогПоРазделу(Данные, ИтоговыеПоля);
	ВывестиРаздел(ДокРезультат, ОбластьРаздел, "10", НазваниеРаздела, СуммаИтог);
	
	РезультатПроверки = РезультатПроверки - СуммаИтог; 
	
	ВывестиРасшифровку(ДокРезультат, Данные, ОбластьОстатки, ОбластьСтрОстатки, ОбластьОстаткиИтог, ИтоговыеПоля);
	
	
	//строка 11. Финрез остатка 
	Данные = РезультатЗапроса._ФинрезСтрока11;
	НазваниеРаздела = "Нереализованные доходы за вычетом расходов от переоценки, отраженные в составе прибыли или убытка за год, для активов, удерживаемых на " + Формат(ЭтотОбъект.Период.ДатаОкончания,  "ДФ=dd.MM.yyyy");
	ИтоговыеПоля = Новый Массив;
	ИтоговыеПоля.Добавить("Сумма");
	СуммаИтог = ВернутьИтогПоРазделу(Данные, ИтоговыеПоля);
	ВывестиРаздел(ДокРезультат, ОбластьРаздел, "11", НазваниеРаздела, СуммаИтог);
	
	ВывестиРасшифровку(ДокРезультат, Данные, ОбластьОстатки, ОбластьСтрОстатки, ОбластьОстаткиИтог, ИтоговыеПоля);
	
	
	//Справочно Вводы 
	Данные = РезультатЗапроса._ВводыУровень;
	Данные.Сортировать("Период, ЦеннаяБумага");
	
	ИтоговыеПоля = Новый Массив;
	ИтоговыеПоля.Добавить("СуммаПриход");
	ИтоговыеПоля.Добавить("СуммаКупонаПриход");
	ИтоговыеПоля.Добавить("СуммаПереоценка");
	ИтоговыеПоля.Добавить("ДисконтПремияПриход");
	ИтоговыеПоля.Добавить("КорректировкаПриход");
	ИтоговыеПоля.Добавить("СуммаКупонПереоценкаПриход");
	ИтоговыеПоля.Добавить("РазницаПППриход");
	
	СуммаИтог = ВернутьИтогПоРазделу(Данные, ИтоговыеПоля);
	НазваниеРаздела = "Справочно: Ввод в ДУ";
	ВывестиРаздел(ДокРезультат, ОбластьРаздел, " ", НазваниеРаздела, СуммаИтог);
	
	РезультатПроверки = РезультатПроверки + СуммаИтог; 
	
	ОбластьВвод = Макет.ПолучитьОбласть("Вводы");
	ОбластьСтрВвод = Макет.ПолучитьОбласть("СтрВводы");
	ОбластьВводИтог = Макет.ПолучитьОбласть("ВводыИтог");

	ВывестиРасшифровку(ДокРезультат, Данные, ОбластьВвод, ОбластьСтрВвод, ОбластьВводИтог, ИтоговыеПоля);
	
	//Справочно. выводы ЦБ
	
	Данные = РезультатЗапроса._ВыводыУровень;
	Данные.Сортировать("Период, ЦеннаяБумага");
	
	ИтоговыеПоля = Новый Массив;
	ИтоговыеПоля.Добавить("СуммаРасход");
	ИтоговыеПоля.Добавить("СуммаКупонаРасход");
	ИтоговыеПоля.Добавить("СуммаПереоценкаРасход");
	ИтоговыеПоля.Добавить("СуммаКупонПереоценкаРасход");
	ИтоговыеПоля.Добавить("ДисконтПремияРасход");
	ИтоговыеПоля.Добавить("КорректировкаРасход");
	ИтоговыеПоля.Добавить("РазницаППРасход");
	СуммаИтог = ВернутьИтогПоРазделу(Данные, ИтоговыеПоля);
	НазваниеРаздела = "Справочно: Вывод из ДУ";
	ВывестиРаздел(ДокРезультат, ОбластьРаздел, " ", НазваниеРаздела, СуммаИтог);
	
	РезультатПроверки = РезультатПроверки - СуммаИтог; 
	
	
	ОбластьПродажа = Макет.ПолучитьОбласть("Продажа");
	ОбластьСтрПродажа = Макет.ПолучитьОбласть("СтрПродажа");
	ОбластьПродажаИтог = Макет.ПолучитьОбласть("ПродажаИтог");

	ВывестиРасшифровку(ДокРезультат, Данные, ОбластьПродажа, ОбластьСтрПродажа, ОбластьПродажаИтог, ИтоговыеПоля);
	
	//ЦБ уровня 3
	Данные = РезультатЗапроса._УровниЦБ_нужные;
	Данные.Сортировать("ЦеннаяБумага, Период");
	НазваниеРаздела = "Сведения о нахождении Ценных бумаг на уровне 3";
	ВывестиРаздел(ДокРезультат, ОбластьРаздел, " ", НазваниеРаздела, 0);

	ОбластьУровни = Макет.ПолучитьОбласть("ЦБуровня3");
	ОбластьСтрУровни = Макет.ПолучитьОбласть("СтрЦБУровня3");
	
	ДокРезультат.НачатьГруппуСтрок();
	ДокРезультат.Вывести(ОбластьУровни);
	
	Для Каждого СтрокаДанные из Данные Цикл 
		ЗаполнитьЗначенияСвойств(ОбластьСтрУровни.Параметры, СтрокаДанные); 
		ДокРезультат.Вывести(ОбластьСтрУровни);
	КонецЦикла;	
	
	ДокРезультат.ЗакончитьГруппуСтрок();
	
	ОбластьПроверка = Макет.ПолучитьОбласть("Проверка");
	ОбластьПроверка.Параметры.РезультатПроверки = РезультатПроверки;
	ДокРезультат.Вывести(ОбластьПроверка);
	
	// все! 
	ДокРезультат.ПоказатьУровеньГруппировокСтрок(0);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры
